{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "my resume - 2024-03-22 06_57_44.pdf",

  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "Welcome to my portfolio! I am a skilled and passionate website developer with a strong background in crafting dynamic and efficient web solutions. My expertise lies in utilizing cutting-edge technologies, with a focus on <span class='underline'>Angular</span> and <span class='underline'>ASP.NET C#</span>. With extensive experience in developing robust and scalable web applications, I bring a wealth of knowledge to every project.",
  "Banner.ActionBtn": "Get in touch",

  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "In my <span class='underline'>dynamic journey as a developer</span>, I seek to train every day. I have cultivated a relentless passion for learning and growth. Throughout my career, I have dedicated myself to daily training, honing my skills to become a versatile and adaptive professional.",
    "In addition to my technical expertise, I have a knack for implementing system improvements and optimizing websites. I strive to identify and standardize patterns that enhance efficiency and consistency. Moreover, I am proactive in suggesting and executing ideas that bring value to the projects I am involved in.",
    "Some of the technologies that I have trained and worked on include (but are not limited to):"
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "DAFTech",
      "Title": "Front-end Developer | Full-stack web developer",
      "Date": "July 2022 - Present",
      "Description": [
        "I leveraged my front-end development skills, particularly in Angular, to contribute to web application development for DAFTech, a social impact organization.",
        "My work involved building new features and functionalities, collaborating with a remote team, and writing clean, maintainable code.",
        "I'm proficient in unit testing and debugging to ensure high-quality deliverables.",
        "Developing and implementing new features and functionalities for web applications using Angular and ASP.NET.",
        "Planning meetings in reports."
      ]
    },
    {
      "Tab": " Ethiojobs",
      "Title": "Software Developer",
      "Date": "August 2021 - October 2021",
      "Description": [
        "Implementing continuous improvements, working on frontend and backend.",
        "Collaborated with cross-functional teams to develop web applications with node.js and express.js, resulting in a 15% increase in customer satisfaction and retention.",
        "Collaborating with interns and senior developers to brainstorm and implement ideas into web app development resulted in a 30% improvement in app performance and a 25% reduction in load time, enhancing user experience.",
        "Gathering user requirements and building project documentation for a system upgrade, leading to a 30% improvement in system performance and a 25% reduction in system downtime."
      ]
    }

  ],

  "FeatureProjects.Title": "My projects",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Streamlined Business Management (ERP)",
      "Description": "Developed a comprehensive Enterprise Resource Planning (ERP) system to centralize and manage critical business functions. This full-stack web application utilizes Angular for a user-friendly front-end experience and ASP.NET Core for a robust and scalable back-end infrastructure.",
      "imgs": [
        "assets/images/midwife/Capture.PNG",
        "assets/images/midwife/Capture1.PNG",
        "assets/images/midwife/Capture01.PNG",
        "assets/images/midwife/Capture2.PNG",
        "assets/images/midwife/Capture3.PNG",
        "assets/images/midwife/Capture4.PNG"
      ],
      "Technologies": ["ASP.NET",
      "Angular",
      "C#",
      "Angular Material",
      "Bootstrap",
      "RxJS",
      "MSSQL"]
    },
    {
      "Title": "Team and Project management",
      "Description": "I have developed a web application that helps big companies to keep track of their employees’ projects and tasks. The app allows admins to assign, approve, and monitor the progress of projects and tasks for their employees. The app also allows employees to create, submit, and view the progress of their own projects and tasks. The app is designed to improve the efficiency and productivity of the workplace by providing a clear and </span>, and <span class='underline'>easy-to-use interface</span> for managing work. ",
      "imgs": [
        "assets/images/team&pm/Capture.PNG",
        "assets/images/team&pm/Capture1.PNG",
        "assets/images/team&pm/Capture2.PNG",
        "assets/images/team&pm/Capture3.PNG"
      ],
      "Technologies": [
        "ASP.NET",
        "Angular",
        "C#",
        "Angular Material",
        "RxJS",
        "MSSQL"
      ]
    },
    {
      "Title": "SMS Service",
      "Description": "Developed a user-friendly bulk SMS sender application designed for large organizations. This Angular-based application simplifies bulk SMS communication with a clear and visually appealing interface ",
      "imgs": [
        "assets/images/SMS/Capture.PNG",
        "assets/images/SMS/Capture1.PNG",
        "assets/images/SMS/Capture2.PNG",
        "assets/images/SMS/Capture3.PNG",
        "assets/images/SMS/Capture4.PNG"

      ],
      "Technologies": ["ASP.NET", "Angular", "C#", "Angular Material", "MSSQL"]
    },

    {
      "Title": "Trans Nation Airways Website",
      "Description": "Developed a user-friendly and informative website for Trans Nation Airways (TNA), a leading Ethiopian charter airline. The redesigned website streamlines the user experience for both potential customers and existing clients",
      "imgs": ["assets/images/tna/Capture.PNG"],
      "ghLink": "https://github.com/matos-coder/MDW_Digital_Marketing_Website",
      "demoLink": "https://www.tna.com.et/",
      "Technologies": ["Angular", "CSS GRID", "SASS", "Angular animations"]

    }

  ],


  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "If you're interested in discussing new opportunities, please feel free to reach out. I'll be delighted to receive your contact, and I'll respond promptly upon seeing your message.",
  "Contact.Btn": "Say Hello"
}
