{
  "Header.Item1": "About me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "Matias Ashenafi CV.pdf",

  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I am a **Backend-Focused Full-Stack Developer** dedicated to building high-availability enterprise systems. I specialize in architecting scalable solutions with <span class='underline'>.NET, NestJS, and Node.js</span>, transforming complex business requirements into high-performance digital reality.",
  "Banner.ActionBtn": "Get in touch",

  "AboutMe.Title": "About me",
  "AboutMe.Paragraphs": [
    "I don't just write code; I build <span class='underline'>scalable digital infrastructure</span>. My journey is defined by a commitment to engineering excellence, focusing on system reliability, data integrity, and performance optimization.",
    "With a deep background in **Enterprise ERP systems**, I specialize in modernizing legacy workflows and architecting secure APIs that handle millions of records. I focus on standardizing design patterns to ensure long-term maintainability and system stability.",
    "My core technology stack includes:"
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "DAFTech",
      "Title": "Front-end Developer | Full-stack web developer",
      "Date": "July 2022 - Present",
      "Description": [
        "Led end-to-end development of high-volume enterprise systems (TMS), successfully supporting 5M+ regional users.",
        "Architected core backend services using ASP.NET Core,NestJS ensuring high availability through optimized database schema design and MSSQL tuning.",
        "Engineered complex business modules, including vehicle valuation algorithms and legal compliance engines (Court Bans).",
        "Modernized manual government workflows into digital systems, reducing processing times from days to minutes.",
        "Collaborated with cross-functional teams to translate regional regulations into secure, scalable technical solutions."
      ]
    },
    {
      "Tab": " Ethiojobs",
      "Title": "Software Developer",
      "Date": "August 2021 - October 2021",
      "Description": [
        "Developed and optimized web applications within an Agile environment, contributing to both frontend and backend modules.",
        "Streamlined system performance through targeted API optimizations and efficient frontend state management.",
        "Gathered and documented technical requirements for major system upgrades, leading to measurable reductions in system downtime.",
        "Collaborated with senior engineers to implement modern design patterns, improving overall application responsiveness."
      ]
    }

  ],

  "FeatureProjects.Title": "My projects",
  "FeatureProjects.Label": "Featured Project",
  "FeatureProjects.Projects": [
    {
      "Title": "Transport Management System (TMS)",
      "Description": "A mission-critical ERP built from scratch to digitize regional transport administration. As Lead Developer, I architected the Vehicle Lifecycle Module, handling complex legal workflows like Court Bans, Ownership Transfers, and Tax Valuation algorithms. I led the migration of millions of legacy records into a secure MSSQL schema, ensuring transactional consistency and reducing processing times from days to minutes.",
      "imgs": [
        "assets/images/tms/admin dashboard.jpg",
        "assets/images/tms/veh reg.jpg",
        "assets/images/tms/stock.jpg",
        "assets/images/tms/vrms dashboard.jpg",
        "assets/images/tms/veh detail.jpg"
      ],
      "Technologies": [
        "ASP.NET Core",
        "Angular",
        "C#",
        "MSSQL",
        "Docker",
        "REST API",
        "Entity Framework"
      ]
    },
    {
      "Title": "Addis Ababa Tourism Digital Platform",
      "Description": "A high-performance tourism portal designed to showcase Addis Ababa to a global audience. I implemented a Headless CMS architecture to decouple content management from the frontend. Using Next.js and Static Site Generation (SSG), I achieved sub-second load times and high SEO rankings. The system empowers non-technical staff to manage dynamic events, destination guides, and weekly newsletters via an intuitive Strapi dashboard.",
      "imgs": [
        "assets/images/aatc/hero.png",
        "assets/images/aatc/1.png",
        "assets/images/aatc/4.png",
        "assets/images/aatc/2.png",
        "assets/images/aatc/3.png",
        "assets/images/aatc/5.png"
      ],
      "demoLink": "https://aatc.gov.et/",
      "Technologies": [
        "Next.js",
        "React",
        "Strapi (Headless CMS)",
        "Tailwind CSS",
        "PostgreSQL",
        "Vercel",
        "SEO Optimization"
      ]
    }
  ],


  "Contact.Pretitle": "What’s Next",
  "Contact.Title": "Get in touch!",
  "Contact.Content": "If you're interested in discussing new opportunities, please feel free to reach out. I'll be delighted to receive your contact, and I'll respond promptly upon seeing your message.",
  "Contact.Btn": "Say Hello"
}
